{
    "users": [
        {
            "id": "joanne.rowling",
            "username": "Joanne Rowling",
            "email": "joanne.rowling@abc.com",
            "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5d/J._K._Rowling_2010.jpg/220px-J._K._Rowling_2010.jpg"
        }, 
        {
            "id": "chris.columbus",
            "username": "Chris Columbus",
            "email": "chris.columbus@abc.com",
            "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/Chris_Columbus.jpg/250px-Chris_Columbus.jpg"
        },
        {
            "id": "newt.scamander",
            "username": "Newt Scamander",
            "email": "newt.scamander@abc.com",
            "photo": "https://vignette.wikia.nocookie.net/harrypotter/images/4/43/NewtonScamander-Profile-crop.png/revision/latest/scale-to-width-down/301?cb=20170112223036"
        },
        {
            "id": "david.yates",
            "username": "David Yates",
            "email": "david.yates@abc.com",
            "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5b/David_Yates_by_Gage_Skidmore.jpg/250px-David_Yates_by_Gage_Skidmore.jpg"
        }
    ],
    "series": [
        {
            "ownerRef": "joanne.rowling",
            "title": "Harry Potter",
            "description": "",
            "tags": ["fantasy", "drama", "mystery", "thriller"],
            "folks": ["chris.columbus", "newt.scamander", "david.yates"]
        }
    ],
    "works": [
        {
            "ownerRef": "joanne.rowling",
            "seriesRef": "Harry Potter",
            "title": "해리포터와 마법사의 돌",
            "type": "novel",
            "contents": "조그만 체구에 갸름한 얼굴을 하고 흐트러진 까만 머리와 초록빛 눈을 가진 소년인 해리 포터는 이마에 번개 모양의 가느다란 흉터가 있고, 늘 헐렁한 헌옷에 낡은 안경을 끼고 다닌다. 해리는 한 살 때 자신의 부모를 살해하고 자신을 공격한 볼드모트의 공격에서 살아남아 마법사 세계에서 이미 '살아남은 아이'로 유명함에도 불구하고 자신이 마법사라는 사실도 모른 채 이모부부네 집에 맡겨진 채 온갖 멸시와 학대와 모욕및 구박을 당하며 계단 밑 벽장에서 불우한 삶을 살아간다. 그러다 해리의 열한번째 생일날에 호그와트의 사냥터지기 해그리드가 나타나서 해리에게 모든 사실을 알려주자 해리는 호그와트라는 마법 학교에 입학하기로 결정하고, 호그와트로 가는 열차에서 여러 학생들과 대면하기도 한다.<br/><br/>호그와트에 도착한 해리는 호그와트 마법 학교에서 마법의 약 제조법, 약초학, 변신술, 어둠의 마법 방어술, 마법의 역사들을 배우게 된다. 빗자루를 타고 공중을 날아다니며 경기하는 스릴 만점의 구기종목 퀴디치 게임에서 수색꾼으로 활약을 하기도 한다. 그러던 어느날 해리는 머리 셋 달린 개 '플러피'가 지키고 있는 마법학교 지하실에 불로장수약 만들수 있고 또 모든것을 황금으로 바꿀수 있는 '마법사의 돌'이 비밀리에 보관되어 있다는 것을 듣게 된다. 그리고 그것을 호시탐탐 노리고 있는 자가 부모를 죽인 볼드모트 경이라는 사실을 알게 되고, 마법약 담당 교수인 스네이프가 볼드모트 경을 도우려 한다는 사실을 확신한다. 해리는 자신들의 가장 친한 친구들인 론과 헤르미온느와 함께 볼드모트보다 먼저 '마법사의 돌'을 찾기 위해 해리의 아버지가 그에게 물려준 투명 망토를 쓴 채 플러피가 지키고 있는 3층으로 향하게 된다. 해그리드가 선물로 준 나무 피리로 플러피를 잠재운 해리와 그의 친구들은 자신들이 각자 가지고 있는 능력등을 이용해 '악마의 덫'이라는 거대한 식물로부터 탈출하고, 날아다니는 열쇠를 잡고, 론의 희생으로 맥고나걸 교수가 만든, 살아 움직이는 체스판을 통과하게 된다.<br/><br/>론을 남겨두고, 해리와 헤르미온느는 서로 다른 모양의 병 일곱 개가 한 줄로 늘어서 있는 방에 도착한다. 헤르미온느가 수수께끼를 풀어내자 해리 자기 자신은 검은 불을 지나가서 마법사의 돌이 있는 쪽으로 나아갈 수 있는 약을 마시고, 헤르미온느에게는 자줏빛 불을 뚫고 돌아가는 약을 마시게 하며, 론에게로 돌아가서 함께 덤블도어에게 연락을 요청한다.<br/><br/>마지막 방에서 해리 포터는 퀴디치 경기에서 자신을 떨어뜨려 죽이려 했던 사람이 사실은 말을 더듬기로 유명한 어둠의 마법 방어술 교수, 퀴렐임을 알게 되었고, 할로윈 때 트롤이 들어와 소동을 일으켰던 일도 그가 했음을 알게 되었다. 아울러, 스네이프는 오히려 해리를 보호하고 있음도 알게 되었다. 퀴렐은 '주인'에게 소망의 거울을 사용하는 법을 알려달라고 요청했고, 해리는 그 '주인'의 목소리에 의해 소망의 거울 앞에 서게 되고, 놀랍게도 해리는 마법사의 돌이 자신의 호주머니 속으로 떨어지는 것을 느낀다.<br/><br/>해리는 자신이 본 것을 말하라는 퀴렐의 요구에 거짓말을 한다. 이에 퀴렐은 터번을 벗었고, 퀴렐의 뒤통수에는 그가 주인이라고 불렀던 볼드모트 경의 얼굴이 달려 있었다. 볼드모트는 퀴렐에게 해리를 죽이라고 명령하였으나 실패하고, 해리는 기절하게 된다. 병동에서 깨어난 해리는 덤블도어 교수를 만나게 되고, 덤블도어는 해리에게 퀴렐이 해리를 죽이지 못한 이유는 해리가 그의 어머니, 릴리 포터가 그에게 남겨준 사랑의 힘 덕분이라는 말을 하였다. 연말 파티에서 덤블도어는 그리핀도르에게 엄청난 점수를 주며 그리핀도르의 우승을 선언한다. 해리는 킹스 크로스 역 9와 4분의 3번 승강장에 친구들과 함께 들어오고, 론과 헤르미온느에게 자신이 방학 동안 집에서 마법을 쓰지 못하도록 되어 있다는 것을 자신의 가족들은 모른다며, 자신은 여름을 두들리와 '재미있게' 보낼 것이라고 말한다."
        },
        {
            "ownerRef": "chris.columbus",
            "seriesRef": "Harry Potter",
            "title": "Harry Potter and the Sorcerer's Stone",
            "type": "movie",
            "contents": "[![](http://img.youtube.com/vi/VyHV0BRtdxo/0.jpg)](https://www.youtube.com/watch?v=VyHV0BRtdxo)"
        },
        {
            "ownerRef": "joanne.rowling",
            "seriesRef": "Harry Potter",
            "title": "해리포터와 비밀의 방",
            "type": "novel",
            "contents": "해리는 더즐리 집에서 최악의 여름을 보내고 있었다. 이때 도비가 나타나 그에게 호그와트로 돌아가지 말 것을 경고하나 그는 무시하고, 결국 마법부의 편지로 더즐리 집 작은 방에 감금되는 수난을 겪는다. 3일 만에 론 위즐리의 도움으로 빠져나와 버로우로 감으로써 자유를 얻었지만, 호그와트로 돌아온 이후 사태가 심상치 않음을 알게 된다.<br/><br/>신임 교수인 질데로이 록허트의 해리에 대한 관심과, 모우닝 머틀의 계속되는 요담, 비밀의 방을 개방한 주범에 대한 문제 등으로 해리는 더욱 궁지에 빠지고 이 과정에서 필치와 어니, 저스틴과의 공방을 겪게 된다. 노리스 부인 이후 콜린 크리비, 저스틴 핀치-플레츨리, 목이 달랑달랑한 닉과 페넬로페 클리어워터가 연속적으로 습격당한 데 이어, 자신의 친구인 헤르미온느까지 습격당하자 호그와트는 더욱 긴장에 빠진다. 설상가상으로 지니까지 슬리데린의 후계자에게 납치당했다는 소식이 들리자 호그와트 폐쇄론까지 제기된다. 이에 해리는 비밀의 방의 진상을 조사하기 위해 톰 리들의 일기장을 꺼내 '비밀의 방에 대하여 아는가?'라고 쓰고, 그 일기장에서 리들의 회상 장면을 본 해리는 리들이 해그리드를 잡아내는 장면을 보고는 그가 비밀의 방을 열었다고 생각하지만 해그리드가 아즈카반에 간 이후로도 습격이 계속 일어나자 그것이 아니라는 것은 곧 밝혀진다.<br/><br/>공격당한 헤르미온느가 들고 있었던 종이에서 해리와 론은 그녀가 바라보기만 해도 사람을 죽일 수 있는 '바실리스크' 에게 습격당했음을 깨닫고, 호그와트에서 도망가려던 록허트 교수를 이끌고 비밀의 방이 있는 모우닝 머틀의 화장실 칸으로 향한다. 그리고 해리는 거기서 파셀통그를 사용해 비밀의 방 문을 연다. 해리와 론이 점점 비밀의 방으로 깊이 들어가자, 겁을 먹은 록허트 교수는 자신이 론의 지팡이를 빼앗아 '오블리비아테' 라는 기억력 마법을 론과 해리에게 사용하려고 하지만, 고장난 론의 지팡이는 주문을 거꾸로 쏘아 오히려 록허트가 기억을 잃게 된다. 록허트의 주문 탓에 돌덩이가 해리와 론을 가로막고, 해리는 혼자서 지니를 구하러 가기로 결심한다.<br/><br/>비밀의 방 안에서 해리는 쓰러진 지니를 발견하고, 톰 리들은 해리에게 지니가 몇 달 동안 자신에게 일기를 써왔으며, 지니는 자신에게 조종당해 바실리스크로 하여금 머글 태생들을 습격하게 했다는 사실을 알려준다. 지니는 겁에 질려서 톰 리들의 일기장을 버렸으나, 해리가 그의 일기장을 발견하자 자신이 무의식 중에 한 일이 밝혀질까 두려워 그 일기장을 다시 훔쳤던 것이다. 리들은 그 틈을 놓치지 않고 지니를 비밀의 방으로 내려오게 했고, 점점 더 윤곽이 뚜렷해졌다. 리들은 자신의 이름인 톰 마볼로 리들(Tom Marvolo Riddle)을 재배열해서 '나는 볼드모트 경이다'(I am Lord Voldemort)라는 글자를 만듬으로써 자신이 바로 볼드모트라는 것을 밝힌다.<br/><br/>톰 리들은 바실리스크로 하여금 해리를 죽이라는 명령을 내린다. 그때, 덤블도어의 불사조, 퍽스가 나타나서 바실리스크의 눈을 멀게 만든다. 퍽스는 마법의 모자를 해리의 발치에 떨어뜨리고, 해리는 모자에서 그리핀도르의 검을 꺼내 바실리스크를 죽이나, 바실리스크의 송곳니가 그의 팔에 깊숙히 박히게 된다. 그러나 불사조 퍽스의 눈물은 해리의 상처를 치료하였고, 해리는 일기장을 파괴하고 지니를 구출한다.톰 리들은 일기장이 파괴되면서 소멸된다. 해리와 지니는 론과 기억을 잃은 록허트 교수와 합류해 퍽스의 날개를 잡고 비밀의 방에서 탈출한다. 지니는 덤블도어의 사무실에서 부모님과 재회해 병동으로 향하고, 덤블도어는 론과 해리에게 각각 기숙사 점수 200점씩을 부여한다. 그때, 드레이코 말포이의 아버지, 루시우스 말포이가 나타나고, 해리는 덤블도어에게 루시우스가 서점에서 위즐리 가족과 마주쳤을 때 지니의 책 사이에 몰래 일기장을 집어넣은 사실을 밝힌다. 루시우스가 분노하며 덤블도어의 사무실을 나가자, 해리는 그를 쫓아가 일부러 도비를 해방시키도록(즉, 도비에게 양말을 던지도록) 유도한다. 그 후 루시우스 말포이는 이사 자리에서 파면을 당하고, 시험은 취소되었고, 그리핀도르는 2년 연속 기숙사 우승컵을 차지한다. 한편, 기억을 잃은 록허트 교수는 성 뭉고 병원에 치료를 받으러 가게 되어, 1년마다 어둠의 마법 방어술 교수가 떠나는 일이 이번에도 벌어졌다."
        },
        {
            "ownerRef": "joanne.rowling",
            "seriesRef": "Harry Potter",
            "title": "해리포터와 아즈카반의 죄수",
            "type": "novel",
            "contents": "여름방학을 맞이해 버논 더즐리의 여동생, 마지 더즐리가 방문한 가운데 호그와트에서 돌아온 해리는 마지가 자신의 부모님을 모욕하자 화를 참지 못하고 마지를 부풀어 올라 공중에 뜨게 만든다. 집을 떠나 프리벳가를 걷던 중, 어둠 속에서 검은 개 한 마리를 발견하게 된다. 오갈 데 없는 해리는 갑자기 나타난 구조버스를 타고 다이애건 골목에 내렸다. 다이애건 골목에 있는 선술집 \"리키 콜드런\"에서 마법부 장관인 코넬리우스 퍼지를 만나게 된다. 미성년자 마법사로서 해리는 마법 사용이 금지되었기 때문에 퇴학을 각오했지만 퍼지 장관은 새로운 학기가 시작될 때까지 \"리키 콜드런\"에 숙식하고 외출은 다이애건 앨리와 리키 콜드런에만 머물러 있는 조건에 한해서 해리를 용서해준다.<br/><br/>여름 방학 마지막 날, 해리는 위즐리 일가와 헤르미온느 그레인저와 재회한다. 그날 밤 \"리키 콜드런\"에서 위즐리 부부의 대화를 엿들은 해리는 볼드모트의 부하로, 해리의 부모를 배신하고 두 사람을 죽음으로 내몬 인물이며 아즈카반을 탈옥한 시리우스 블랙이 자신의 목숨을 노리고 있다는 것을 알게 된다. 호그와트로 가는 열차 안에서 갑자기 입맞춤으로 영혼을 빨아들이는 아즈카반의 죄수, 디멘터가 침입하였고, 해리는 기절하게 된다. 그러나 새 어둠의 마법 방어술 교수인 루핀이 디멘터들을 물리친다. 학교에 도착한 해리와 론, 그리고 헤르미온느는 디멘터들이 이번 해 동안 호그와트에 배치될 것이라는 사실을 덤블도어에 의해 알게 된다. 호그와트에서 해리는 디멘터들 때문에 많은 어려움을 겪게 되고, 심지어는 퀴디치 경기 도중 디멘터와 마주쳐 추락하는 일까지 벌어진다. 이에, 해리는 루핀 교수와 패트로누스 마법을 연습하기로 결심한다.<br/><br/>해리는 호그스미드 허가서에 사인을 받지 않았기 때문에 호그스미드에 갈 수 없었으나, 투명 망토와 위즐리 쌍둥이가 준 호그와트 비밀 지도 덕분에 몰래 호그스미드로 갈 수 있게 된다. 호그스미드 안에서 해리는 퍼지 장관과 학교 선생님들, 그리고 해그리드가 시리우스 블랙은 해리 부모님의 절친한 친구였으나, 블랙이 포터 부부의 비밀 파수꾼이 된 이후로 그는 볼드모트에게 정보를 넘겨 해리의 부모님을 죽게 했고, 더불어 13명의 머글들과 그의 옛 친구였던 피터 페티그루까지 살해했다는 말을 엿듣게 된다. 한편, 론의 쥐인 스캐버스가 사라지자 론은 헤르미온느의 고양이, 크룩생크가 그를 잡아먹었다고 의심하고, 둘의 우정은 흔들리게 된다. 크리스마스 때, 해리는 누군가로부터 새로운 빗자루 파이어볼트를 받게 되지만, 그 빗자루에 저주가 걸려 있을까봐 걱정한 헤르미온느에 의해 맥고나걸 교수에게 그 빗자루를 넘겨야만 했다.<br/><br/>드레이코 말포이는 신비한 동물 수업 시간에 '벅빅' 이라는 히포그리프를 자극하다 다치게 되고, 벅빅은 사형선고를 받게 된다. 이에 해리와 론, 그리고 헤르미온느는 벅빅을 구하기 위해 온갖 노력을 하지만, 판결을 되돌릴 수는 없었고, 그들은 사형 집행인이 벅빅에게 도끼를 내려치는 소리를 듣게 된다. 갑자기 스캐버스가 다시 나타났고, 론은 스캐버스를 쫓아가지만, 해리가 올해 들어서 3번이나 봤던 검은 개에 의해 공격당하고 말았다. 그 개는 론을 비명을 지르는 오두막집으로 끌고 가고, 해리와 헤르미온느는 론을 구하기 위해 오두막집 안으로 들어가야 했다. 그들이 오두막집으로 들어가자마자, 검은 개는 시리우스 블랙의 원래 모습으로 되돌아온다. 그때, 루핀 교수가 오두막집 안으로 들어오고, 시리우스와 루핀은 해리와 친구들에게 모든 것을 설명해 주기 시작한다. 루핀 교수 자신은 늑대인간이며, 해리의 아버지, 시리우스, 그리고 피터 패티그루 이 네 명이 모두 애니마구스(동물로 변할 수 있는 마법사)들이었으며, 론의 쥐 스캐버스는 사실 피터 페티그루라는 사실과 함께, 시리우스가 아니라 피터가 해리의 부모님을 배신했다는 사실까지 알려준다. 그때 갑자기 스네이프 교수가 나타나 루핀에게 지팡이를 겨눈다. 루핀과 시리우스가 해명을 하지만, 스네이프는 그들의 말을 듣지 않고 시리우스를 디멘터에게 넘기려 했고, 해리와 그의 친구들은 스네이프에게 마법을 쏘아 기절시킨다. 루핀과 시리우스는 변신한 페티그루를 원래 모습으로 되돌리고 그를 죽이려 하지만, 해리는 자신의 부모님이라도 그를 죽이는 걸 원치 않았을 거라며, 그 두 사람을 말린다. 그들이 페티그루를 디멘터에게 넘겨주기 위해 호그와트로 향하는 순간, 늑대인간으로 변하지 않는 약을 잊고 먹지 않은 루핀이 늑대인간으로 변해버리고, 페티그루는 쥐로 변해 도망친다. 그때, 수많은 디멘터들이 나타나고, 해리와 친구들은 정신을 잃는다.<br/><br/>병동에서 해리와 친구들은 시리우스가 곧 디멘터의 입맞춤을 받아 영혼을 잃어버리게 될 것이라는 사실을 듣게 된다. 덤블도어는 헤르미온느에게 그녀가 가지고 있는 시간을 되돌리는 시계를 사용하라 조언하고, 해리와 헤르미온느는 과거로 돌아가 벅빅을 구출하고, 해리는 패트로누스 마법으로 과거의 자신을 둘러싸고 있는 수많은 디멘터들을 물리친다. 이후, 해리와 친구들은 방학을 맞이해 집으로 돌아가게 된다. 한편, 스네이프 교수가 아이들에게 루핀이 늑대 인간이라는 사실을 폭로해, 루핀 교수는 교직을 떠나게 되고, 어둠의 마법 방어술 교수직은 다시 공석으로 남게 된다."
        },
        {
            "ownerRef": "joanne.rowling",
            "seriesRef": "Harry Potter",
            "title": "해리포터와 불의 잔",
            "type": "novel",
            "contents": "4학년이 된 해리는 여름방학동안 위즐리 가족과 함께 퀴디치 월드컵을 관람한다. 경기가 끝난후 축제분위기로 들뜬 텐트촌에서 볼드모트를 숭배하는 죽음을 먹는 자들이 나타나서 주위를 온통 광란의 도가니로 몰아넣고 하늘에는 볼드모트의 상징인 '어둠의 표식'이 나타난다. 개학이 되어서 다시 호그와트로 돌아간 해리는 덤블도어로부터 올해에는 퀴디치 게임이 안 열리는 대신 트리위저드 시합을 개최하게 되었다는 뜻밖의 소식을 듣는다. 보바통과 덤스트랭 그리고 호그와트의 챔피언들이 한 명씩 참가하는 트리위저드 시합의 우승자는 1천 갈레온의 상금과 최고의 영예를 얻게 된다. 그러나 17세 이상의 학생만이 이 시합에 참가할 수 있었기 때문에 해리는 자신의 이름을 불의 잔에 넣을 수가 없었다.<br/><br/>해리는 어둠의 마법 방어술을 가르치기 위해 새로 부임한 무디 교수와 돈독한 우의를 다지게 된다. 전직 오러출신이었던 무디 교수는 어둠의 마법사들을 몹시 증오했으며, 해리에게 커다란 애정을 품고 있었다. 불의 잔은 호그와트의 챔피언으로 케드릭 디고리, 덤스트랭의 챔피언으로 빅터 크룸, 보바통의 챔피언으로 플뢰르 델라쿠르를 선발한다. 그런데 불의 잔은 네 번째 챔피언으로 해리 포터를 지명했다. 해리가 불의 잔에 자신이 이름을 몰래 집어넣었다고 모든 사람들이 의심하지만, 덤블도어는 트리위저드 시합을 예정대로 진행시키기로 결정한다. 론은 해리가 불의 잔에 이름을 몰래 집었다고 생각해 해리를 냉담하게 대하고, 그들의 우정은 크게 흔들린다.<br/><br/>첫번째 시합 전날, 해그리드는 해리에게 첫번째 시험은 용과 대적하는 것이라고 몰래 말해준다. 해리는 맥심 부인(보바통의 교장)과 카르카로프(덤스트랭의 교장)이 플뢰르와 빅터 크룸에게 이 사실을 미리 알려주었다는 걸 눈치채고, 케드릭에게도 이 사실을 전해준다. 해리는 시험 때 헝가리의 혼테일을 피해 무사히 황금알을 가져오게 되고, 빅터 크룸과 함께 공동 1위를 달리게 된다. 론은 해리의 모습을 보고 자신이 해리를 의심했던 것을 후회하며, 해리를 굳게 믿게 된다. 해리는 획득한 황금알을 친구들이 보는 앞에서 열어보지만, 매우 큰 소리를 참지 못하고 다시 황금알을 닫는다.<br/><br/>한편, 왜곡된 보도로 악명이 높은 '예언자 일보'의 기자, 리타 스키터는 해리와 헤르미온느에 관한 확인되지 않은 열애설을 보도하고, 해그리드가 거인 혼혈이라는 것을 폭로한다.<br/><br/>크리스마스 무도회가 다가오고, 해리는 파트너를 골라야 하는 상황에 직면한다. 해리는 초 챙에게 파트너 신청을 하지만, 초는 케드릭이 자신에게 먼저 파트너 신청을 했음을 밝힌다. 그러자 론은 여동생 지니에게 해리와 함께 무도회에 가라고 권하지만, 지니 역시 네빌에게 파트너 신청을 받은 상태라, 해리와 론은 각각 패르바티와 파드마 패틸과 함께 무도회를 가게 되었다.<br/><br/>황금알의 비밀을 풀기 위해 해리는 반장들의 욕실로 들어가 목욕을 하기로 결심하고, 그곳에서 화장실의 유령 모우닝 머틀에게 물 속에 황금알을 넣어 보라는 조언을 받게 된다. 두번째 시합의 내용은 바로 인어들로부터 챔피언들이 가장 소중하게 여기는 사람을 구출해 오는 것이었다. 해리는 시합 10분전까지 물속에서 숨을 쉬는 법을 찾지 못하나, 관련풀이 있다는 네빌 로바텀도 숨을 쉬는 아가미풀을 건네준다. 해리는 자신의 인질인 론뿐만 아니라, 플뢰르 델라쿠르의 동생, 가브리엘까지 구출하는데 성공하고, 덕분에 케드릭 디고리와 함께 가장 높은 점수를 받게 된다.<br/><br/>마지막 시험을 한 달 남기고, 해리는 빅터 크룸과 이야기를 나누던 중 실종되었던 마법부의 고위 관료, 바르테미우스 크라우치가 실성한 채 호그와트에 나타나, 덤블도어에게 경고를 해야 한다고 말하는 것을 듣고 덤블도어를 데리러 간다. 그러나 해리가 덤블도어를 데리고 왔을 때 크라우치는 또다시 사라졌고, 빅터 크룸은 기절한 채로 쓰러져 있었다.<br/><br/>마지막 시험은 미로를 통과하는 시험이었다. 해리는 미로 안에서 수많은 장애물들을 만나게 되고, 빅터 크룸에게 공격받는 케드릭 디고리를 구출하게 된다(당시 빅터릭크룸리는 폴리주스 마법의 약을 먹고 매드아이 무디로 변장한 바티 크라우치 2세에게 임페리우스 저주에 걸린 상태였음). 케드릭과 함께 두 사람은 미로를 통과하고 우승컵을 동시에 잡지만, 그 우승컵은 사실 공동묘지로 그들을 인도하는 포트키였다. 그곳에서 해리의 부모님을 배신한 피터 페티그루는 케드릭을압 살해케답, 볼살인 아을지의뼈, 자신의 살, 그리고 해리의 피를 이용해 볼드모트를 다시금 부활시킨다. 볼드모트는 자신을 떠났던 죽음을 먹는 자들을 다시 공동묘지로 불러들이고, 그들을 꾸짖은 뒤에 해리를 죽이고자 그에게 결투를 요구한다. 그러나, 해리와 볼드모트의 지팡이는 동시에 마법을 부려 둘의 마법은 서로 충돌하고, 역주문 효과(프리오리 인칸타템)에 의해 해리의 부모님을 포함한 볼드모트가 죽인 사람의 형상들이 서서히 나타난다. 그 형상들은 해리가 다시 포트키를 가지고 호그와트로 도망칠 수 있도록 시간을 벌어주었고, 해리는 케드릭의 시신을 안고 다시 호그와트로 돌아간다.<br/><br/>호그와트를 잡아한 해리를 무디 교수가 자신의 사무실로 데려가고, 그는 자신이 '볼드모트의 충실한 하인'이자 불의 잔에 해리의 이름을 넣은 장본인이며 해리가 우승을 차지해 포트키를 빨리 잡을 수 있도록 간접적으로 지원했다는 것을 폭로하고 그를 죽이려 한다. 그러나, 맥고나걸 교수와 스네이프 교수, 덤블도어 교수가 무디를 막아선다. 그들은 진실만을 말하는 약, 베리타세룸을 무디에게 먹였고, 무디가 사실은 실종된 바티 크라우치의 아들, 바티 크라우치 2세임을 알게 된다. 바티 크라우치는 죽음을 먹는 자인 자신의 아들을 감옥에 보냈으나, 부인의 간청에 의해 아들로 변장한 부인과 자신의 아들을 몰래 맞바꾸었던 것이다. 바티 크라우치 주니어는 퀴디치 경기장에서 하늘에 '어둠의 표식' 을 띠운 장본인이며, 아버지가 덤블도어에게 이런 사실을 알리려 하자 그를 살해한 것이었다. 그들은 즉각 트렁크에 갇혀 있던 진짜 무디를 구출해냈고, 덤블도어는 해리의 우승을 선언한다.<br/><br/>퍼지 장관을 포함한 많은 사람들은 볼드모트의 귀환을 믿지 않고, 예언자 일보의 기자 리타 스키터의 기사만을 믿으며 해리를 미친 사람 취급한다. 또한, 아즈카반의 간수인 디멘터는 바티 크라우치 주니어를 보자마자 그의 영혼을 빼앗게 된다. 헤르미온느는 교정 안으로 들어올 수 없게 된 리타 스키터가 사실은 동물로 변신한 애니마구스였기에(딱정벌레로 변신함) 사람들의 대화를 엿들을 수 있음을 알게 되고, 리타 스키터에게 다시는 변신을 하지 않겠다는 약속을 받아낸다. 한편, 해리는 집으로 돌아가는 호그와트 열차 내에서 자신의 우승 상금을 모두 프레드와 조지 위즐리에게 주고, 그들이 장난감 가게를 열 수 있도록 도와준 뒤, 더즐리 가족과 함께 자신의 집으로 돌아간다."
        },
        {
            "ownerRef": "newt.scamander",
            "seriesRef": "Harry Potter",
            "title": "신비한 동물 사전",
            "type": "essay",
            "contents": "애크로맨툴라<br/><br/>사람의 말을 할 수 있을 정도의 지능을 지닌 거대 거미. 이외에 일반 거미랑은 다르게 사람을 집어올릴 수 있을 정도의 집게발을 가지고 있다. 이것의 알은 A급 금지 품목으로 지정되었다. 작중 등장한 애크로맨툴라로 위 사진의 아라고그가 있다. 해그리드는 호그와트 재학 당시 애크로맨툴라의 알을 구해 부화시켜 아라고그라는 이름을 붙여 길렀고[9] 이후 아라고그가 금지된 숲으로 탈출한 후 해그리드가 구해준 암컷과 결혼해 알을 낳고 자식들을 길러 금지된 숲을 더욱 마경으로 만들었다.<br/>대화가 가능할 정도의 지능을 가졌지만 보통 포악한 생물이 아니라 위험도가 높다. 아라고그는 해그리드만은 자신이 알일 때부터 돌봐준 은인이기에 손을 대지 않았으나 해리와 론은 (해그리드의 친구임을 알면서도) 잡아먹으려 들었으며, 7권에서 아라고그의 자식들은 최후의 전쟁에 참여하여 호그와트측 사람들과 죽음을 먹는 자들을 가리지 않고 공격했다.<br/>신비한 동물 사전에는 스코틀랜드에 애크로맨툴라들의 집단 서식지가 있다는 소문이 있지만 확인된 바는 없다라는 문구와 해리와 론이 진짜라는 걸 확인했음이라는 낙서가 있다. 참고로 호그와트는 스코틀랜드 어딘가에 있다.<br/><br/><br/>애쉬와인더<br/><br/>마법의 불을 오랫동안 끄지 않고 방치했을 때 불길 속에서 태어나는 뱀. 태어난지 한 시간이 지나면 재로 변해 죽는데, 죽기 전에 구석진 곳에 알을 낳는다. 애쉬와인더의 알은 엄청나게 뜨거운 열기를 발산하여 그대로 방치해두면 집을 불태워버리지만(!), 일단 마법으로 차갑게 식히면 사랑의 묘약의 재료나 학질 치료약 등으로 엄청난 가치를 가진다."
        },
        {
            "ownerRef": "david.yates",
            "seriesRef": "Harry Potter",
            "title": "Fantastic Beasts and Where to Find Them",
            "type": "movie",
            "contents": "[![](http://img.youtube.com/vi/Vso5o11LuGU/0.jpg)](https://www.youtube.com/watch?v=Vso5o11LuGU)"
        }
    ]
}