{
    "users": [
        {
            "id": "conan.doyle",
            "username": "Arthur Conan Doyle",
            "email": "conan.doyle@abc.com",
            "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Arthur_Conany_Doyle_by_Walter_Benington%2C_1914.png/242px-Arthur_Conany_Doyle_by_Walter_Benington%2C_1914.png"
        },
        {
            "id": "guy.ritchie",
            "username": "Guy Ritchie",
            "email": "guy.ritchie@abc.com",
            "photo": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/14/GuyRitchiebyKathyHutchins.jpg/250px-GuyRitchiebyKathyHutchins.jpg"
        }
    ],
    "series": [
        {
            "ownerRef": "conan.doyle",
            "title": "Sherlock Holmes",
            "description": "",
            "tags": ["detective"],
            "folks": ["guy.ritchie"]
        }
    ],
    "works": [
        {
            "ownerRef": "conan.doyle",
            "seriesRef": "Sherlock Holmes",
            "title": "A Study in Scarlet",
            "type": "novel",
            "contents": "제 1부, 육군 군의관을 지낸 존 H. 왓슨의 회상<br/><br/>의학박사 존 H. 왓슨은 영국군의 군의관으로, 아프가니스탄 전장으로 향하지만 왼쪽 어깨에 부상을 입어 영국으로 다시 송환된다. 하는 일 없이 지내고 있다가 옛날 조수였던 스탬포드에게서 셜록 홈즈라는 특이한 인물을 소개받아 베이커 가에서 공동생활을 시작한다. 첫 대면임에도 불구하고 '아프가니스탄에서 오셨나 보군요' 라는 말로 홈즈가 왓슨이 부상을 입어 아프가니스탄에서 돌아온 것을 추리했던 것과 같이 모르는 사람의 경력을 맞추는 홈즈의 관찰력과 추리력은 왓슨을 놀라게 한다.<br/><br/>두 사람은 첫 대면 후 바로 다음 날, 베이커가 221B번지에 있는 방에서 공동 생활을 하게 된다. 그 일이 끝나자, 홈즈와 왓슨은 점차 생활의 틀을 잡아가며 새 환경에 적응하게 되었다.<br/><br/>공동생활을 시작한지 며칠 후, 홈즈는 왓슨에게 자신이 '자문 탐정'이라는 사실을 밝힌다. 왓슨이 그의 추리력 중 몇개를 허풍이라고 생각하자, 홈즈는 그의 집으로 들어온 한 편지 전달자가 퇴역한 해병대 하사관임을 다시금 추리해낸다.<br/><br/>편지를 읽고 살인사건이 발생했다는 사실을 알게 된 홈즈는 왓슨과 같이 현장으로 향한다. 사건 현장에서 그들은 런던 경시청의 그렉슨 경감과 레스트레이드 경감을 만나게 된다. 살해 현장인 브릭스턴로 로리스턴 가든 3번지엔 피해자인 이녹 드레버 씨가 끔찍한 모습으로 죽어있고, 벽에 피로 쓰여진 ‘RACHE（라헤, 독일어로 복수라는 의미）’가 쓰여 있었으며, 여자의 결혼반지가 떨어져 있었다. 홈즈는 시체의 여기저기를 샅샅이 조사하고, 이녹 드레버가 독살당했음을 알아낸다.<br/><br/>제 2부, 성도들의 나라<br/><br/>북 아메리카 내륙의 사막. 존 페리어와 고아 루시는 사막을 헤매다 결국 죽을 뻔 했지만, 브리검 영이 거느리며 이동 중인 모르몬 교도 집단 모르몬 개척자가 도와준다. 그들은 솔트레이크시티를 건설하였고, 존 페리어는 교외에서 열심히 일하여, 결국 굴지의 부호가 되었다. 또한 그는 루시를 양녀로 맞아 자신의 딸처럼 귀여워하였다. 성장한 루시는 아름다운 미녀가 되었다.<br/><br/>어느 날 루시는, 청년 제퍼슨 호프에게 반하였고, 호프도 그녀에게 호의를 가졌다. 아버지 존은 두 사람의 결혼을 허락하였으나 잠시 호프가 마을을 떠났을 때, 모르몬교의 교주 브리검 영은 루시에게 청년 드리버나 스탠거스와의 결혼을 명하였다. 반대가 허용되지 않는, 그래서 지도자의 말에 거역하면 탄압받는 모르몬교의 특징때문에 존은 마을에서의 탈주를 결심하고 호프를 다시 불러낸다. 지리에 밝은 호프의 도움으로 존과 루시는 아무도 없는 황야를 답파한다. 그러던 중 추격을 하던 모르몬교 사람들이 호프가 없는 틈에 존을 사살하고 루시를 데리고 돌아간다."
        },
        {
            "ownerRef": "conan.doyle",
            "seriesRef": "Sherlock Holmes",
            "title": "The hound of the Baskervilles",
            "type": "novel",
            "contents": "바스커빌 가문의 개라는 전설이 있는 부호 바스커빌 가문에서 당주 찰스 바스커빌 경이 시체로 발견된다. 표면상으로는 심장 발작으로 인한 병사라고 발표되었지만, 경의 시체 근처에는 거대한 개의 발자국이 있었다.<br/><br/>셜록 홈즈는 사건의 조사를 찰스 경의 주치의며 친구였던 모티머 박사(Dr. James Mortimer)에게서 의뢰를 받게된다. 자식이 없던 찰스 경의 후계자로는 찰스 경의 조카인 헨리 바스커빌 경(Sir Henry Baskerville)이 잇게 된다. 하지만 모티머 박사와 같이 런던에 온 헨리경에게 바스커빌 관으로 향하는 것을 경고하는 의문의 편지가 도착한다.<br/><br/>홈즈는 런던에서의 다른 사건에 관여하게 되어, 왓슨 박사가 대신 헨리 경의 손님으로 바스커빌 관에 동행하게 된다.<br/><br/>사정이 있는 듯한 집사 베리모어(Barrymore)와 그 아내, 탈옥범 셀던, 근처에 사는 곤충학자 스태플턴(John Stapleton)과 그의 아름다운 동생 베릴(Beryl Stapleton) 등, 왓슨은 보고 들은 것을 나중에 홈즈가 보도록 편지나 자신의 일기에 적는다."
        },
        {
            "ownerRef": "conan.doyle",
            "seriesRef": "Sherlock Holmes",
            "title": "The Valley of Fear",
            "type": "novel",
            "contents": "셜록 홈즈는 숫자가 나열된 암호문을 받고 그것을 해독한다. 거기에 쓰여 있던 것은 벌스톤 관의 더글러스라는 남자에게 위험이 닥친다는 내용으로 홈즈와 존 왓슨이 현장에 도착할 때, 이미 더글러스는 시체로 발견되었다.<br/><br/>더글러스는 벌스톤에 있는 자신의 저택 서재에서 총신을 잘라내어 짧게 한 산탄총으로 인해 아주 가까운 거리에서 머리를 관통당했다. 산탄총과 쇠망치, 창 문턱 위에 피가 묻은 폭이 넓은 구두자국, 그리고 한쪽밖에 없는 아령 등이 남겨져 있었다. 벌스톤의 저택에는 해자가 있어, 밤중에는 해자를 건너는 다리를 올려버리기 때문에 범인은 해자를 헤엄쳐서 도망쳤다고 밖에 생각할 수 없었지만, 저택의 주의에서는 흠뻑 젖은 사람은 찾을 수 없었다고 한다.<br/><br/>홈즈는 사건의 제1발견자인 바커와 더글러스 부인이 공모하여 거짓말을 하고 있다고 왓슨에게 이야기 한다. 홈즈는 왓슨의 양산을 빌려 저택에 돌아가 무언가의 조사를 개시한다."
        },
        {
            "ownerRef": "guy.ritchie",
            "seriesRef": "Sherlock Holmes",
            "title": "Sherlock Holmes",
            "type": "movie",
            "contents": "[![](http://img.youtube.com/vi/J7nJksXDBWc/0.jpg)](https://www.youtube.com/watch?v=J7nJksXDBWc)"
        },
        {
            "ownerRef": "guy.ritchie",
            "seriesRef": "Sherlock Holmes",
            "title": "Sherlock Holmes: Game of Shadows",
            "type": "movie",
            "contents": "[![](http://img.youtube.com/vi/V1OYiPa-eLg/0.jpg)](https://www.youtube.com/watch?v=V1OYiPa-eLg)"
        }
    ]
}